In [32]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
df.shape

(891, 15)

In [4]:
df.isnull().sum() #number of NaN values in the column

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
df.dropna(subset = ['embarked'], inplace = True) #remove rows with Nan values in embarked column

In [6]:
mean_of_age = df['age'].mean()
median_of_age = df['age'].median()
mode_of_age = df['age'].mode()

In [7]:
df.groupby('alive')['alive'].value_counts() #classification on the basis of person's survival

alive  alive
no     no       549
yes    yes      340
Name: alive, dtype: int64

In [8]:
342/891

0.3838383838383838

In [9]:
df.groupby('alive')['age'].mean() #mean on the basis of above classification

alive
no     30.626179
yes    28.193299
Name: age, dtype: float64

In [10]:
age_groupby = df.groupby(['survived', 'sex','class','embarked'])['age'].mean()
print(age_groupby)

survived  sex     class   embarked
0         female  First   C           50.000000
                          S           13.500000
                  Second  S           36.000000
                  Third   C           20.700000
                          Q           28.100000
                          S           23.688889
          male    First   C           43.050000
                          Q           44.000000
                          S           45.362500
                  Second  C           29.500000
                          Q           57.000000
                          S           33.414474
                  Third   C           27.555556
                          Q           28.076923
                          S           27.168478
1         female  First   C           35.675676
                          Q           33.000000
                          S           33.619048
                  Second  C           19.142857
                          Q           30.000000
                          S           29.091667
                  Third   C           11.045455
                          Q           17.600000
                          S           22.548387
          male    First   C           36.437500
                          S           36.121667
                  Second  C            1.000000
                          S           17.095000
                  Third   C           18.488571
                          Q           29.000000
                          S           22.933333
Name: age, dtype: float64

In [11]:
df['age'].fillna(value = -1, inplace = True) #replacing Nan values in age column with -1

In [12]:
#replacing the -1 with the respective mean of the catagory
for row in range(len(age_groupby.index)):
    print(row)
    df.loc[(df['survived'] == age_groupby.index[row][0]) & (df['sex'] == age_groupby.index[row][1]) & (df['class'] == age_groupby.index[row][2]) & (df['embarked'] == age_groupby.index[row][3]) & (df['age'] == -1), 'age'] = age_groupby.values[row]

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30

In [13]:
df['age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
5      28.076923
6      54.000000
7       2.000000
8      27.000000
9      14.000000
10      4.000000
11     58.000000
12     20.000000
13     39.000000
14     14.000000
15     55.000000
16      2.000000
17     17.095000
18     31.000000
19     11.045455
20     35.000000
21     34.000000
22     15.000000
23     28.000000
24      8.000000
25     38.000000
26     27.555556
27     19.000000
28     17.600000
29     27.168478
         ...
861    21.000000
862    48.000000
863    23.688889
864    24.000000
865    42.000000
866    27.000000
867    31.000000
868    27.168478
869     4.000000
870    26.000000
871    47.000000
872    33.000000
873    47.000000
874    28.000000
875    15.000000
876    20.000000
877    19.000000
878    27.168478
879    56.000000
880    25.000000
881    33.000000
882    22.000000
883    28.000000
884    25.000000
885    39.000000
886    27.000000
887    19.000000
888    23.688889
889    26.000000
890    32.000000
Name: age, Length: 889, dtype: float64

In [14]:
mean_of_new_age = df['age'].mean()
print("mean of age is: ", mean_of_age, '\n', "mean of new age is: ", mean_of_new_age)

mean of age is:  29.64209269662921
 mean of new age is:  29.242572908368796

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
#encoding columns with 0s and 1s
le_sex = LabelEncoder()
le_sex.fit(df['sex'])
df['sex'] = le_sex.transform(df['sex'])

le_class = LabelEncoder()
le_class.fit(df['class'])
df['class'] = le_class.transform(df['class'])

le_embarked = LabelEncoder()
le_embarked.fit(df['embarked'])
df['embarked'] = le_embarked.transform(df['embarked'])

In [17]:
#defining x and y to run the machine learning model on, in this case RandomForestClassificier
x =df[[x for x in df.columns if x not in ['alive','survived','who','embark_town', 'pclass', 'sibsp', 'adult_male', 'deck', 'parch', 'fare', 'age']]]
y = df['alive']

In [18]:
x.head()

   sex  embarked  class  alone
0    1         2      2  False
1    0         0      0  False
2    0         2      2   True
3    0         2      0  False
4    1         2      2   True

In [19]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier()

In [20]:
x_train, x_test, y_train, y_test  = train_test_split(x, y, test_size =0.2, random_state = 42)

In [40]:
model = rf.fit(x_train, y_train)

In [22]:
y_pred = rf.predict(x_test)

In [36]:
y_test = np.array(y_test).reshape(-1,1)

In [39]:
y_test = pd.DataFrame(y_test)
y_test.head()

     0
0   no
1  yes
2  yes
3   no
4  yes